In [33]:
import pandas as pd

In [35]:
calendar = pd.read_csv('data_util/calendar.csv')
calendar.head()

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,6369,2021-02-13,t,$50.00,$50.00,1.0,1125.0
1,6369,2021-02-14,t,$50.00,$50.00,1.0,1125.0
2,6369,2021-02-15,t,$50.00,$50.00,1.0,1125.0
3,6369,2021-02-16,t,$50.00,$50.00,1.0,1125.0
4,6369,2021-02-17,t,$50.00,$50.00,1.0,1125.0

In [36]:
calendar.shape

(7357924, 7)

In [37]:
reviews = pd.read_csv('data_util/reviews.csv')
reviews.head()

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,6369,29428,2010-03-14,84790,Nancy,Simon and Arturo have the ultimate location in...
1,6369,31018,2010-03-23,84338,David,Myself and Kristy originally planned on stayin...
2,6369,34694,2010-04-10,98655,Marion,We had a great time at Arturo and Simon's ! A ...
3,6369,37146,2010-04-21,109871,Kurt,I very much enjoyed the stay. \r\nIt's a wond...
4,6369,38168,2010-04-26,98901,Dennis,Arturo and Simon are polite and friendly hosts...

In [38]:
reviews.shape

(633124, 6)

In [39]:
listings = pd.read_csv('data_util/listings.csv')
listings.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,6369,"Rooftop terrace room , ensuite bathroom",13660,Simon,Chamartín,Hispanoamérica,40.45724,-3.67688,Private room,50,1,78,2020-09-20,0.59,1,180
1,21853,Bright and airy room,83531,Abdel,Latina,Cármenes,40.40341,-3.74084,Private room,31,4,33,2018-07-15,0.43,2,364
2,23001,Apartmento Arganzuela- Madrid Rio,82175,Jesus,Arganzuela,Legazpi,40.38695,-3.69304,Entire home/apt,50,15,0,NaN,NaN,7,347
3,24805,Gran Via Studio Madrid,101471,Iraido,Centro,Universidad,40.42202,-3.70395,Entire home/apt,92,5,10,2020-03-01,0.13,1,88
4,24836,"Select the Madrid more ""cool"".",101653,Tenty,Centro,Justicia,40.41995,-3.69764,Entire home/apt,115,3,68,2020-01-26,0.58,1,358

In [40]:
listings.shape

(20156, 16)

In [41]:
vecindario = pd.read_csv('data_util/neighbourhoods.csv')
vecindario.head()

  neighbourhood_group neighbourhood
0          Arganzuela       Acacias
1          Arganzuela        Atocha
2          Arganzuela       Chopera
3          Arganzuela      Delicias
4          Arganzuela      Imperial

In [42]:
vecindario.shape

(128, 2)

In [44]:
calendar.isnull().sum()

listing_id           0
date                 0
available            0
price                0
adjusted_price       0
minimum_nights    1342
maximum_nights    1342
dtype: int64

In [45]:
reviews.isnull().sum()

listing_id         0
id                 0
date               0
reviewer_id        0
reviewer_name      1
comments         325
dtype: int64

In [46]:
listings.isnull().sum()

id                                   0
name                                 3
host_id                              0
host_name                           20
neighbourhood_group                  0
neighbourhood                        0
latitude                             0
longitude                            0
room_type                            0
price                                0
minimum_nights                       0
number_of_reviews                    0
last_review                       5975
reviews_per_month                 5975
calculated_host_listings_count       0
availability_365                     0
dtype: int64

In [47]:
vecindario.isnull().sum()

neighbourhood_group    0
neighbourhood          0
dtype: int64

### CALENDAR

In [48]:
## a calendar le quitamos las labels minimum-maximum nights y adjusted price

In [49]:
calendar = calendar.drop(['adjusted_price', 'minimum_nights', 'maximum_nights'], axis=1)
calendar.head()

   listing_id        date available   price
0        6369  2021-02-13         t  $50.00
1        6369  2021-02-14         t  $50.00
2        6369  2021-02-15         t  $50.00
3        6369  2021-02-16         t  $50.00
4        6369  2021-02-17         t  $50.00

In [50]:
calendar.isnull().sum()

listing_id    0
date          0
available     0
price         0
dtype: int64

In [51]:
## ahora le hacemos label encoding a avaliable: 0 o 1 en vez de True False

In [52]:
from sklearn import preprocessing

In [53]:
label_encoding = preprocessing.LabelEncoder()
calendar['available'] = label_encoding.fit_transform(calendar['available'].astype(str))

calendar.head()

   listing_id        date  available   price
0        6369  2021-02-13          1  $50.00
1        6369  2021-02-14          1  $50.00
2        6369  2021-02-15          1  $50.00
3        6369  2021-02-16          1  $50.00
4        6369  2021-02-17          1  $50.00

In [80]:
calendar.shape

(7357924, 4)

In [74]:
## guardamos calendar
calendar = pd.DataFrame(calendar)
calendar.to_csv('data_procesada/calendar.csv')

### Reviews

In [54]:
reviews.shape

(633124, 6)

In [55]:
reviews.isnull().sum()

listing_id         0
id                 0
date               0
reviewer_id        0
reviewer_name      1
comments         325
dtype: int64

In [56]:
reviews = reviews.dropna()

In [57]:
reviews.shape

(632798, 6)

In [75]:
## guardamos reviews
reviews = pd.DataFrame(reviews)
reviews.to_csv('data_procesada/reviews.csv')

### Listings

In [58]:
listings.shape

(20156, 16)

In [59]:
listings.isnull().sum()

id                                   0
name                                 3
host_id                              0
host_name                           20
neighbourhood_group                  0
neighbourhood                        0
latitude                             0
longitude                            0
room_type                            0
price                                0
minimum_nights                       0
number_of_reviews                    0
last_review                       5975
reviews_per_month                 5975
calculated_host_listings_count       0
availability_365                     0
dtype: int64

In [60]:
listings.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,6369,"Rooftop terrace room , ensuite bathroom",13660,Simon,Chamartín,Hispanoamérica,40.45724,-3.67688,Private room,50,1,78,2020-09-20,0.59,1,180
1,21853,Bright and airy room,83531,Abdel,Latina,Cármenes,40.40341,-3.74084,Private room,31,4,33,2018-07-15,0.43,2,364
2,23001,Apartmento Arganzuela- Madrid Rio,82175,Jesus,Arganzuela,Legazpi,40.38695,-3.69304,Entire home/apt,50,15,0,NaN,NaN,7,347
3,24805,Gran Via Studio Madrid,101471,Iraido,Centro,Universidad,40.42202,-3.70395,Entire home/apt,92,5,10,2020-03-01,0.13,1,88
4,24836,"Select the Madrid more ""cool"".",101653,Tenty,Centro,Justicia,40.41995,-3.69764,Entire home/apt,115,3,68,2020-01-26,0.58,1,358

In [61]:
listings = listings.drop(['id','name', 'host_id', 'host_name','last_review', 
                          'reviews_per_month', 'calculated_host_listings_count'], axis=1)
listings.head()

,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,availability_365
0,Chamartín,Hispanoamérica,40.45724,-3.67688,Private room,50,1,78,180
1,Latina,Cármenes,40.40341,-3.74084,Private room,31,4,33,364
2,Arganzuela,Legazpi,40.38695,-3.69304,Entire home/apt,50,15,0,347
3,Centro,Universidad,40.42202,-3.70395,Entire home/apt,92,5,10,88
4,Centro,Justicia,40.41995,-3.69764,Entire home/apt,115,3,68,358

In [62]:
listings.isnull().sum()

neighbourhood_group    0
neighbourhood          0
latitude               0
longitude              0
room_type              0
price                  0
minimum_nights         0
number_of_reviews      0
availability_365       0
dtype: int64

In [63]:
## hay que hacer label encoding a: 'neighbourhood_group', 'neighbourhood' y 'roomprice'

In [65]:
label_encoding = preprocessing.LabelEncoder()
listings['neighbourhood_group'] = label_encoding.fit_transform(listings['neighbourhood_group'].astype(str))

listings.head()

,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,availability_365
0,4,Hispanoamérica,40.45724,-3.67688,Private room,50,1,78,180
1,9,Cármenes,40.40341,-3.74084,Private room,31,4,33,364
2,0,Legazpi,40.38695,-3.69304,Entire home/apt,50,15,0,347
3,3,Universidad,40.42202,-3.70395,Entire home/apt,92,5,10,88
4,3,Justicia,40.41995,-3.69764,Entire home/apt,115,3,68,358

In [66]:
label_encoding = preprocessing.LabelEncoder()
listings['neighbourhood'] = label_encoding.fit_transform(listings['neighbourhood'].astype(str))

listings.head()

,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,availability_365
0,4,60,40.45724,-3.67688,Private room,50,1,78,180
1,9,44,40.40341,-3.74084,Private room,31,4,33,364
2,0,67,40.38695,-3.69304,Entire home/apt,50,15,0,347
3,3,117,40.42202,-3.70395,Entire home/apt,92,5,10,88
4,3,65,40.41995,-3.69764,Entire home/apt,115,3,68,358

In [67]:
label_encoding = preprocessing.LabelEncoder()
listings['room_type'] = label_encoding.fit_transform(listings['room_type'].astype(str))

listings.head()

,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,availability_365
0,4,60,40.45724,-3.67688,2,50,1,78,180
1,9,44,40.40341,-3.74084,2,31,4,33,364
2,0,67,40.38695,-3.69304,0,50,15,0,347
3,3,117,40.42202,-3.70395,0,92,5,10,88
4,3,65,40.41995,-3.69764,0,115,3,68,358

In [68]:
listings.isnull().sum()

neighbourhood_group    0
neighbourhood          0
latitude               0
longitude              0
room_type              0
price                  0
minimum_nights         0
number_of_reviews      0
availability_365       0
dtype: int64

In [79]:
listings.shape

(20156, 9)

In [76]:
## guardamos listings
listings = pd.DataFrame(listings)
listings.to_csv('data_procesada/listings.csv')

### Vecindario

In [70]:
vecindario.head()

  neighbourhood_group neighbourhood
0          Arganzuela       Acacias
1          Arganzuela        Atocha
2          Arganzuela       Chopera
3          Arganzuela      Delicias
4          Arganzuela      Imperial

In [71]:
vecindario.isnull().sum()

neighbourhood_group    0
neighbourhood          0
dtype: int64

In [72]:
label_encoding = preprocessing.LabelEncoder()
vecindario['neighbourhood_group'] = label_encoding.fit_transform(vecindario['neighbourhood_group'].astype(str))

vecindario.head()

   neighbourhood_group neighbourhood
0                    0       Acacias
1                    0        Atocha
2                    0       Chopera
3                    0      Delicias
4                    0      Imperial

In [73]:
label_encoding = preprocessing.LabelEncoder()
vecindario['neighbourhood'] = label_encoding.fit_transform(vecindario['neighbourhood'].astype(str))

vecindario.head()

   neighbourhood_group  neighbourhood
0                    0              1
1                    0             18
2                    0             33
3                    0             45
4                    0             63

In [78]:
vecindario.shape

(128, 2)

In [77]:
## guardamos vecindario
vecindario = pd.DataFrame(vecindario)
vecindario.to_csv('data_procesada/vecindario.csv')